{
  "@gusev_edward": "Ну ясен хуй ты приглашён",
  "@olissan_blomst": "Было бы странно с моей стороны тебя не пригласить :)",
  "@paulWhite43": "Так, тебе нужно взять гитару и хорошее настроение",
  "@griniy_blogger": "ДАРОВА ГРИШ ОЧКА ДАБРО ПАЖАЛАВАТЬ НА ПРАЗДНИК 54 ГОДА ИСПОЛНИЛОСЬ ДЕДУ ДА",
  "@pashapuh": "ну шо перхоть, не дай боже ты откажешься, я прокрадусь к тебе в комнату и разъебу ммр в доте да сука масло масло масло",
  "@NosoVlad": "Дарова сладкий, я знаю у нас близко дни рождения, но один раз в жизни я хочу всех пригласить и круто затусить так что ничего не хочу слушать",
  "@sablevsky": "Привет вафля, твоя задача нормально пить и толкать прохладные. Сольёшься - дам пизды. Можешь взять Настю, но это в лс",
  "@wiski_w": "Короче я в благородство играть не буду. Подаришь пиздатый подарок и мы в расчёте.",
  "@scherbitsky": "Две новости. Плохая - тебе надо ехать в Минск. Хорошая - ты увидишь меня и весело проведёшь время. Отказал = отсосал",
  "@OlegKomissarov247": "Я оч сомневаюсь что Олег приедет один, учитывая что вы настолько уже далеко зашли. Иногда мне кажется что это один человек и у него две головы. Обе головы приглашены.",
  "@alexdubovetsky": "Вес можешь не вести, но если привезёшь я вдвойне буду тебе рад",
  "u121293023_5086239187125891888": "Мы мало общаемся и поэтому мне грустно ходить в офис. Если парень отпустит - приезжай, будет весело. А, ну и если не приедешь, то можешь сразу место работы новое искать...",
  "@SonrienteNatali": "Ты всё ещё близкий и дорогой человек, я был бы рад тебя видеть. Если ты сможешь, конечно.",
  "u316041729_17313644416916098294": "Тебе надо поддержать Наташу, а ну и ты главное много не пей, а то парни не угонятся и тебе не с кем будет танцевать :)",
  "@annkader": "Аня, у тебя две задачи: пить и фотографировать. Последовательность выбирай сама. Фотографировать не обязательно.",
  "@fedarenchyk": "Значит залетаешь с двух ног, кричишь: \" Слава Украине! \" . Зигуешь. Наебениваешься в хлам. Аню не забудь ",
  "@balabayonce": "Ты не представляешь как я обижусь, если ты не приедешь. Хотя, если ты не планируешь тверкать, то лучше сразу скажи."
}
